# CategorySet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySet Constructor
CategorySet Class See Also
---
Initializes a new instance of the CategorySet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CategorySet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CategorySet()
```

# See Also
CategorySet Class
Autodesk.Revit.DB Namespace